# 판다스
## 다양한 포멧의 파일을 DataFrame으로 로딩할 수 있는 api 목록
- read_table(): 탭으로 구분
- read_csv(): ,로 구분하는게 기본이나 sep='{구분인자}'식으로 입력해주면 탭으로 구별하는 것도 가능
    - 별다른 파라미터지정이 없으면 파일의 맨 처음 로우를 컬럼명으로 인지하고 컬럼으로 변환

In [1]:
import pandas as pd

In [3]:
titanic_df = pd.read_csv("titanic_train.csv")
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## 데이터프레임의 형태를 알아보는 방법
- .shape: 열, 크기를 튜플로 반환
- .info(): 총 데이터 건수와 데이터 타입, null 건수를 알 수 있음
- .describe(): 컬럼별 숫자형 데이터값의 분포도, 평균값, 최댓값, 최솟값을 알려줌

In [4]:
print(f"shape: {titanic_df.shape}")
print(f"info: {titanic_df.info()}")
print(f"describe: {titanic_df.describe()}")

shape: (891, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
info: None
describe:        PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

## Series
- index와 단 하나의 컬럼만으로 구성된 데이터 세트
- dataframe의 특정 컬럼값만 가져오면 Series의 형태로 특정 컬럼 데이터세트가 반환됨
- value_counts(): 해당 컬럼값의 유형과 건수 확인 가능

In [8]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

print(type(titanic_df['Pclass']))

3    491
1    216
2    184
Name: Pclass, dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 모든 Dataframe과 Series는 인덱스를 반드시! 가진다

## 넘파이 ndarray, 리스트, 딕셔너리를 Dataframe으로 변환하기
- dataframe과 넘파이의 ndarray 상호간의 변환은 매우 빈번하게 발생
- Dataframe: 행과 열을 가지는 2차원 데이터로 2차원 이하 데이터만 df로 변환이 가능하다.

In [11]:
# ndarray -> df
import numpy as np

col_name = ['col1']
list1 = [1, 2, 3]
arr = np.array(list1)
print(f"arr shape: {arr.shape}")
df1 = pd.DataFrame(list1, columns=col_name)
print(df1) # 리스트이용
df2 = pd.DataFrame(arr, columns=col_name)
print(df2)

arr shape: (3,)
   col1
0     1
1     2
2     3
   col1
0     1
1     2
2     3